# Taps
tap "anomalyco/tap"
tap "blacktop/tap"
tap "bramstein/webfonttools"
tap "entireio/tap"
tap "excitedplus1s/repo"
tap "iina/mpv-iina"
tap "junghoonghae/tossinvest-cli"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lihaoyun6/tap"
tap "steipete/tap"

# CLI Tools (Formulae)
brew "coreutils" # GNU core utilities
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "openssh"
brew "screen"
brew "wget"
brew "git"
brew "git-lfs"
brew "gh"
brew "bash"
brew "bash-completion@2"
brew "zsh"
brew "tmux"
brew "neovim"
brew "htop"
brew "btm" # bottom
brew "fzf"
brew "jq"
brew "tree"
brew "rclone"
brew "rsync"
brew "nmap"
brew "aria2"
brew "yt-dlp"
brew "ffmpeg"
brew "imagemagick"
brew "python@3.13"
brew "node"
brew "yarn"
brew "rust"
brew "go"
brew "docker"
brew "docker-compose"
brew "gnupg"
brew "mas" # Mac App Store CLI
brew "koekeishiya/formulae/skhd"

# Casks (GUI Apps)
cask "iterm2"
cask "warp"
cask "ghostty"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "sublime-text"
cask "cursor"
cask "windsurf"
cask "google-chrome"
cask "google-chrome@beta"
cask "microsoft-edge"
cask "firefox"
cask "brave-browser"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "logseq"
cask "capacities"
cask "simplenote"
cask "hammerspoon"
cask "karabiner-elements"
cask "rectangle"
cask "alt-tab"
cask "dockdoor"
cask "jordanbaird-ice"
cask "hiddenbar"
cask "stats"
cask "iina"
cask "plex"
cask "discord"
cask "slack"
cask "zoom"
cask "telegram"
cask "kakao-talk" # App Store 권장이나 Cask로도 가능
cask "anki"
cask "calibre"
cask "utm"
cask "postman"
cask "cyberduck"
cask "keka"
cask "daisydisk"
cask "appcleaner"

# Mac App Store Apps (MAS)
mas "Xcode", id: 497799835
mas "KakaoTalk", id: 869223134
mas "Goodnotes", id: 1444383602
mas "Tailscale", id: 1475387142
mas "Perplexity", id: 6714467650

# VS Code Extensions
vscode "ms-python.python"
vscode "github.copilot-chat"
vscode "anthropic.claude-code"